[
    [
        {
            "institution": "SAN JOSE STATE UNIVERSITY",
            "date": "May 2018",
            "title": "Bachelor of Science, Computer Science",
            "body": "The education was mainly Java based programming, but I also learned JavaScript, PHP, C++, Python, Data Structures, Algorithms, OOP, and Problem Solving."
        },
        {
            "institution": "VISTA DEL LAGO",
            "date": "Aug 2009 - May 2013",
            "title": "Highschool",
            "body": "I graduated highschool, I really ejoyed Math, Science, and Technology. Here is where I really fell in love with computers and knew I wanted to do something with computer technology."
        }
    ],
    [
        {
            "institution": "Google Fiber (Tekmark Contractor)",
            "date": "July 2018 - January 2020",
            "title": "Tools Specialist",
            "body": "Working as a tools specialist I implemented new Front-End Web Features on Google Fiber site. Connected new Back-End to existing Front-End web components. Created and Maintained various Experiments to smoothly Test and Launch new features. Fixed bugs with existing code including Customer Facing production bugs. Participated in revamping front-end Unit Tests and Functional Tests for Google Fiber Portal components."
        },
        {
            "institution": "Ambii",
            "date": "Fall 2017 - Spring 2018 & Summer 2020 - present",
            "title": " Software Engineer",
            "body": "Working as a software developer to create a dashboard in React. Created new UI elements for login functionality. Used AWS to host a NodeJs and Express.Js back-end server. Responsible for creating asynchronous RESTful Web Services and SocketIO for real-time cross-platform continuity. And was involved in the Analysis, Design, and implementation of the application."
        },
        {
            "institution": "ID Tech Camps",
            "date": "Summer 2016/2017",
            "title": "Tech Camp Instructor",
            "body": "Engaged students in STEM program as an instructor. Led classes focused on Java, MInecraft, modding, and teaching fundamentals of game design. Communicated effectively and efficiently to a wide variety of personality types."
        },
        {
            "institution": "Interbound",
            "date": "Spring 2015",
            "title": "Back-End Developer",
            "body": "Created new back-end features for web app. Collaborated with a technical team to troubleshoot problems related to user interaction and web page. Worked within team to redesign app and key features."
        }
    ]
]